# 2023년은 검은 토끼의 해
# 시간 제한	메모리 제한	제출	정답	맞힌 사람	정답 비율
# 2 초	512 MB	704	470	400	73.801%
# 문제
# 2023년은 검은 토끼의 해로 불린다. 스타는 검은 토끼의 해를 기념해서 흑묘 복권을 만들려고 한다.

# 흑묘 복권은 총 
# $N$개의 티켓으로 구성된다. 각 티켓에는 
# $1$ 이상 
# $N$ 이하의 정수인 시리얼 번호가 적혀 있으며 서로 다른 티켓에는 서로 다른 시리얼 번호가 적혀있다.

# 티켓 중에서 시리얼 번호가 네 자릿수 이상이고 서로 다른 자리에서 네 개의 자릿수를 골라 고른 자릿수를 제외한 나머지 자릿수를 지울 때 2023을 만들 수 있으면 해당 티켓은 당첨 티켓이다. 예를 들어 시리얼 번호가 2023, 1280423, 2200233이면 당첨이고 3480, 572, 2032이면 꽝이다.

#  
# $N$이 주어졌을 때, 흑묘 복권의 당첨 티켓 수를 구하여라

# 입력
# 흑묘 복권의 티켓 수 
# $N$이 주어진다. 
# $(1 \leq N \leq 10\,000\,000)$ 

# 출력
# 당첨 티켓 수를 출력한다.

# 예제 입력 1 
# 2023
# 예제 출력 1 
# 1
# 예제 입력 2 
# 1237987
# 예제 출력 2 
# 1994
# 예제 입력 3 
# 35
# 예제 출력 3 
# 0

import sys
answer = '2023'
n = int(sys.stdin.readline().rstrip())
cnt = 0
for i in range(2023, n+1):
    if str(i).count('2') == 2 and str(i).count('0') == 1 and str(i).count('3') == 1:
        print(i)
        index = 0
        for j in str(i):
            if j == answer[index]:
                index += 1
            
            if index == 4:
                cnt += 1
                print(i)
                break
            

print(cnt)